package Laba6.Example47;

public class Example47 {
    public static void main(String[] args) {
        for(int i = 0; i < 5; i++){
            myClass.viewNum();
        }
    }
}
//        2. Напишите программу с классом, в котором есть закрытое статическое
//        целочисленное поле с начальным нулевым значением. В классе должен быть описан
//        статический метод, при вызове которого отображается текущее значение статического
//        поля, после чего значение поля увеличивается на единицу.