package Laba6.Example53;

public class Example53 {
    public static void main(String[] args) {
        int[] nums = new int[]{5, 15, 6, 3, 10, 10, 33, 2};
        System.out.println(myClass.MidNumber(nums));
    }
}
//        8. Напишите программу со статическим методом, аргументом которому передается
//        целочисленный массив, а результатом возвращается среднее значение для элементов
//        массива (сумма значений элементов, деленная на количество элементов в массиве).