package Laba4;

public class Example31 {
    public static void main(String[] args) {
        int l = 23;
        int h = 11;
        for(int i = 0; i < h; i++){
            for(int j = 0; j < l; j++){
                System.out.print("+");
            }
            System.out.println("");
        }
    }
}

//        1. Напишите программу, которая выводит в консольное окно
//        прямоугольник, размеры сторон которого, ширина: 23 колонки, высота: 11
//        строк;