package Laba6.Example55;

import java.util.Arrays;

public class Example55 {
    public static void main(String[] args) {
        System.out.println(Arrays.toString(myClass.TwoNums(7, 20, 22, 55, 36, 71, 3, 5, 71, 552, 30)));
    }
}
//10. Напишите программу со статическим методом, аргументом которому передается
//произвольное количество целочисленных аргументов. Результатом метод возвращает
//массив из двух элементов: это значения наибольшего и наименьшего значений среди
//аргументов, переданных методу.